// FullStack-розробник 5.0
// Модуль №23. Масиви і цикли
// JS HomeWork3

// Домашня робота 3. Олена Верба
// ----------------------------------------------
// *** 1 ***

// У вас є масив об’єктів fruts, і в кожному з них є name
// Напишіть код, який перетворює їх в масив імен.

// const fruts = [
//   { id: 0, name: 'Apple' },
//   { id: 1, name: 'Tomat' },
//   { id: 2, name: 'Cherry' },
//   { id: 3, name: 'Orange' },
// ];
// let frutsNаme = fruts.map(item => item.name);
// console.log(frutsNаme);

// ----------------------------------------------
// *** 2 ***
//Виведіть парні числа від 2 до 10, використовуючи цикл for.

// for (let i = 2; i <= 10; i++) {
//   if (i % 2 !== 0) continue;
//   console.log(i);
// }

// ----------------------------------------------
// *** 3 ***

//Замініть цикл "for" на "while"

// for (let i = 0; i < 5; i++) {
//   console.log(`цифра ${i}!`);
// }

// let i = 0;
// while (i < 5) {
//   console.log(`цифра ${i}!`);
//   i++;
// }

// ----------------------------------------------
// *** 4 ***
//Напишіть цикл, який пропонує prompt ввести число більше за 100.
//Якщо відвідувач введе менше число – попросити ввести ще раз, і так далі.
//Цикл повинен запитувати число доти, доки відвідувач не введе число,
// більше за 100, або не скасує ввід/введе порожній рядок.

// Варіант 1:

// let rez = 0;
// while (!(!(rez = prompt('Введіть число більше 100')) || Number(rez) > 100)) {}
// console.log('Rezultat', rez);

// Варіант 2:

// let value;
// while (true) {
//   value = prompt('Введiть число більше 100');
//   if (Number(value) > 100 || !value) break;
// }
// console.log(value);

// ----------------------------------------------
// *** 5 ***
// Вирахуйте середній вік

// const girls = [
//   { age: 23, name: 'Оля' },
//   { age: 29, name: 'Аня' },
//   { age: 10, name: 'Юля' },
//   { age: 20, name: 'Катя' },
// ];

// let summ = 0;
// for (let i = 0; i < girls.length; i++) summ += girls[i].age;
// console.log('Cередній вік = ', summ / girls.length);

// Варіант 2:

// let midlAge = girls.reduce((sum, item) => sum + item.age, 0);
// console.log(midlAge / girls.length);
